terraform plan output:

`Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.data_pipeline.google_cloudfunctions2_function.chunk_writes will be replaced due to changes in replace_triggered_by
-/+ resource "google_cloudfunctions2_function" "chunk_writes" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/climateiq-test/locations/us-central1/functions/generate-feature-matrix" -> (known after apply)
      - labels           = {} -> null
        name             = "generate-feature-matrix"
      ~ state            = "ACTIVE" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-06-24T20:51:26.736362459Z" -> (known after apply)
      ~ url              = "https://us-central1-climateiq-test.cloudfunctions.net/generate-feature-matrix" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/27139891303/locations/us-central1/builds/701bd8f9-57b7-4413-8ef4-1632a5b3a72d" -> (known after apply)
          ~ docker_repository     = "projects/climateiq-test/locations/us-central1/repositories/gcf-artifacts" -> (known after apply)
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ bucket     = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions"
                  ~ generation = 1719262164555589 -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ event_trigger {
          ~ pubsub_topic          = "projects/climateiq-test/topics/eventarc-us-central1-generate-feature-matrix-895028-822" -> (known after apply)
          ~ trigger               = "projects/climateiq-test/locations/us-central1/triggers/generate-feature-matrix-895028" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_cpu                    = "2" -> (known after apply)
          + gcf_uri                          = (known after apply)
          ~ max_instance_count               = 100 -> (known after apply)
          ~ max_instance_request_concurrency = 1 -> (known after apply)
          - min_instance_count               = 0 -> null
          ~ service                          = "projects/climateiq-test/locations/us-central1/services/generate-feature-matrix" -> (known after apply)
          ~ uri                              = "https://generate-feature-matrix-bzdnjry7qa-uc.a.run.app" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

  # module.data_pipeline.google_cloudfunctions2_function.delete_citycat_config will be replaced due to changes in replace_triggered_by
-/+ resource "google_cloudfunctions2_function" "delete_citycat_config" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/climateiq-test/locations/us-central1/functions/delete-citycat-config-metadata" -> (known after apply)
      - labels           = {} -> null
        name             = "delete-citycat-config-metadata"
      ~ state            = "ACTIVE" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-06-24T20:51:26.213235180Z" -> (known after apply)
      ~ url              = "https://us-central1-climateiq-test.cloudfunctions.net/delete-citycat-config-metadata" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/27139891303/locations/us-central1/builds/050b8c66-41f9-448d-82fb-7daac3f67da9" -> (known after apply)
          ~ docker_repository     = "projects/climateiq-test/locations/us-central1/repositories/gcf-artifacts" -> (known after apply)
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ bucket     = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions"
                  ~ generation = 1719262164538313 -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ event_trigger {
          ~ pubsub_topic          = "projects/climateiq-test/topics/eventarc-us-central1-delete-citycat-config-metadata-197941-347" -> (known after apply)
          ~ trigger               = "projects/climateiq-test/locations/us-central1/triggers/delete-citycat-config-metadata-197941" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_cpu                    = "0.3333" -> (known after apply)
          + gcf_uri                          = (known after apply)
          ~ max_instance_count               = 100 -> (known after apply)
          ~ max_instance_request_concurrency = 1 -> (known after apply)
          - min_instance_count               = 0 -> null
          ~ service                          = "projects/climateiq-test/locations/us-central1/services/delete-citycat-config-metadata" -> (known after apply)
          ~ uri                              = "https://delete-citycat-config-metadata-bzdnjry7qa-uc.a.run.app" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

  # module.data_pipeline.google_cloudfunctions2_function.labels_processor will be replaced due to changes in replace_triggered_by
-/+ resource "google_cloudfunctions2_function" "labels_processor" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/climateiq-test/locations/us-central1/functions/write-processed-citycat-labels" -> (known after apply)
      - labels           = {} -> null
        name             = "write-processed-citycat-labels"
      ~ state            = "ACTIVE" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-06-24T20:51:38.359876930Z" -> (known after apply)
      ~ url              = "https://us-central1-climateiq-test.cloudfunctions.net/write-processed-citycat-labels" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/27139891303/locations/us-central1/builds/54477c62-d7f3-4e48-b113-a5f3bec7e3fc" -> (known after apply)
          ~ docker_repository     = "projects/climateiq-test/locations/us-central1/repositories/gcf-artifacts" -> (known after apply)
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ bucket     = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions"
                  ~ generation = 1719262164515080 -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ event_trigger {
          ~ pubsub_topic          = "projects/climateiq-test/topics/eventarc-us-central1-write-processed-citycat-labels-048859-878" -> (known after apply)
          ~ trigger               = "projects/climateiq-test/locations/us-central1/triggers/write-processed-citycat-labels-048859" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_cpu                    = "2" -> (known after apply)
          + gcf_uri                          = (known after apply)
          ~ max_instance_count               = 100 -> (known after apply)
          ~ max_instance_request_concurrency = 1 -> (known after apply)
          - min_instance_count               = 0 -> null
          ~ service                          = "projects/climateiq-test/locations/us-central1/services/write-processed-citycat-labels" -> (known after apply)
          ~ uri                              = "https://write-processed-citycat-labels-bzdnjry7qa-uc.a.run.app" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

  # module.data_pipeline.google_cloudfunctions2_function.study_area_write will be replaced due to changes in replace_triggered_by
-/+ resource "google_cloudfunctions2_function" "study_area_write" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/climateiq-test/locations/us-central1/functions/write-study-area-metadata" -> (known after apply)
      - labels           = {} -> null
        name             = "write-study-area-metadata"
      ~ state            = "ACTIVE" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-06-24T20:51:24.349038327Z" -> (known after apply)
      ~ url              = "https://us-central1-climateiq-test.cloudfunctions.net/write-study-area-metadata" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/27139891303/locations/us-central1/builds/71ac754c-f277-4ffa-8da4-86ff5dba6ec4" -> (known after apply)
          ~ docker_repository     = "projects/climateiq-test/locations/us-central1/repositories/gcf-artifacts" -> (known after apply)
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ bucket     = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions"
                  ~ generation = 1719262164538163 -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ event_trigger {
          ~ pubsub_topic          = "projects/climateiq-test/topics/eventarc-us-central1-write-study-area-metadata-648808-276" -> (known after apply)
          ~ trigger               = "projects/climateiq-test/locations/us-central1/triggers/write-study-area-metadata-648808" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_cpu                    = "0.3333" -> (known after apply)
          + gcf_uri                          = (known after apply)
          ~ max_instance_count               = 100 -> (known after apply)
          ~ max_instance_request_concurrency = 1 -> (known after apply)
          - min_instance_count               = 0 -> null
          ~ service                          = "projects/climateiq-test/locations/us-central1/services/write-study-area-metadata" -> (known after apply)
          ~ uri                              = "https://write-study-area-metadata-bzdnjry7qa-uc.a.run.app" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

  # module.data_pipeline.google_cloudfunctions2_function.write_citycat_config will be replaced due to changes in replace_triggered_by
-/+ resource "google_cloudfunctions2_function" "write_citycat_config" {
      ~ effective_labels = {} -> (known after apply)
      ~ environment      = "GEN_2" -> (known after apply)
      ~ id               = "projects/climateiq-test/locations/us-central1/functions/write-citycat-config-data" -> (known after apply)
      - labels           = {} -> null
        name             = "write-citycat-config-data"
      ~ state            = "ACTIVE" -> (known after apply)
      ~ terraform_labels = {} -> (known after apply)
      ~ update_time      = "2024-06-24T20:51:36.601822093Z" -> (known after apply)
      ~ url              = "https://us-central1-climateiq-test.cloudfunctions.net/write-citycat-config-data" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ build_config {
          ~ build                 = "projects/27139891303/locations/us-central1/builds/adec3053-28f1-4538-9445-c284ea93e689" -> (known after apply)
          ~ docker_repository     = "projects/climateiq-test/locations/us-central1/repositories/gcf-artifacts" -> (known after apply)
          ~ environment_variables = {} -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ source {
              ~ storage_source {
                  ~ bucket     = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions"
                  ~ generation = 1719262164537689 -> (known after apply)
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ event_trigger {
          ~ pubsub_topic          = "projects/climateiq-test/topics/eventarc-us-central1-write-citycat-config-data-043254-196" -> (known after apply)
          ~ trigger               = "projects/climateiq-test/locations/us-central1/triggers/write-citycat-config-data-043254" -> (known after apply)
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ service_config {
          ~ available_cpu                    = "0.3333" -> (known after apply)
          + gcf_uri                          = (known after apply)
          ~ max_instance_count               = 100 -> (known after apply)
          ~ max_instance_request_concurrency = 1 -> (known after apply)
          - min_instance_count               = 0 -> null
          ~ service                          = "projects/climateiq-test/locations/us-central1/services/write-citycat-config-data" -> (known after apply)
          ~ uri                              = "https://write-citycat-config-data-bzdnjry7qa-uc.a.run.app" -> (known after apply)
            # (6 unchanged attributes hidden)
        }
    }

  # module.data_pipeline.google_storage_bucket.source must be replaced
-/+ resource "google_storage_bucket" "source" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "test-climateiq-cloud-functions" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions" # forces replacement
      ~ project                     = "climateiq-test" -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/test-climateiq-cloud-functions" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://test-climateiq-cloud-functions" -> (known after apply)
        # (3 unchanged attributes hidden)

      - soft_delete_policy {
          - effective_time             = "2024-05-29T20:23:27.134Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

  # module.data_pipeline.google_storage_bucket_object.source must be replaced
-/+ resource "google_storage_bucket_object" "source" {
      ~ bucket           = "test-climateiq-cloud-functions" -> "test-climateiq-cnn-cloud-functions" # forces replacement
      + content          = (sensitive value)
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "LxDmDg==" -> (known after apply)
      ~ detect_md5hash   = "EhEbRuZoYtS/SRbGUiAUlw==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "test-climateiq-cloud-functions-cloud_function_source.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "EhEbRuZoYtS/SRbGUiAUlw==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/test-climateiq-cloud-functions/o/cloud_function_source.zip?generation=1719262163797339&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "cloud_function_source.zip"
      ~ output_name      = "cloud_function_source.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/test-climateiq-cloud-functions/o/cloud_function_source.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (1 unchanged attribute hidden)
    }

  # module.export_pipeline.google_cloudfunctions2_function.trigger_export_function will be created
  + resource "google_cloudfunctions2_function" "trigger_export_function" {
      + effective_labels = (known after apply)
      + environment      = (known after apply)
      + id               = (known after apply)
      + location         = "us-central1"
      + name             = "trigger-export-pipeline"
      + project          = "climateiq-test"
      + state            = (known after apply)
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
      + url              = (known after apply)

      + build_config {
          + build                 = (known after apply)
          + docker_repository     = (known after apply)
          + entry_point           = "subscribe"
          + environment_variables = (known after apply)
          + runtime               = "python311"

          + source {
              + storage_source {
                  + bucket     = "test-climateiq-frontend-cloud-functions"
                  + generation = (known after apply)
                  + object     = "cloud_function_source.zip"
                }
            }
        }

      + event_trigger {
          + event_type            = "google.cloud.storage.object.v1.finalized"
          + pubsub_topic          = (known after apply)
          + retry_policy          = "RETRY_POLICY_RETRY"
          + service_account_email = (known after apply)
          + trigger               = (known after apply)
          + trigger_region        = "us-central1"

          + event_filters {
              + attribute = "bucket"
              + value     = "test-climateiq-predictions"
            }
        }

      + service_config {
          + all_traffic_on_latest_revision   = true
          + available_cpu                    = (known after apply)
          + available_memory                 = "4Gi"
          + environment_variables            = {
              + "BUCKET_PREFIX" = "test-"
            }
          + gcf_uri                          = (known after apply)
          + ingress_settings                 = "ALLOW_ALL"
          + max_instance_count               = (known after apply)
          + max_instance_request_concurrency = (known after apply)
          + service                          = (known after apply)
          + service_account_email            = (known after apply)
          + timeout_seconds                  = 540
          + uri                              = (known after apply)
        }
    }

  # module.export_pipeline.google_project_iam_member.gcs_pubsub_publishing will be created
  + resource "google_project_iam_member" "gcs_pubsub_publishing" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-27139891303@gs-project-accounts.iam.gserviceaccount.com"
      + project = "climateiq-test"
      + role    = "roles/pubsub.publisher"
    }

  # module.export_pipeline.google_project_iam_member.trigger_export_artifactregistry_reader will be created
  + resource "google_project_iam_member" "trigger_export_artifactregistry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "climateiq-test"
      + role    = "roles/artifactregistry.reader"
    }

  # module.export_pipeline.google_project_iam_member.trigger_export_invoking will be created
  + resource "google_project_iam_member" "trigger_export_invoking" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "climateiq-test"
      + role    = "roles/run.invoker"
    }

  # module.export_pipeline.google_project_iam_member.trigger_export_publishing will be created
  + resource "google_project_iam_member" "trigger_export_publishing" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "climateiq-test"
      + role    = "roles/pubsub.publisher"
    }

  # module.export_pipeline.google_project_iam_member.trigger_export_receiving will be created
  + resource "google_project_iam_member" "trigger_export_receiving" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "climateiq-test"
      + role    = "roles/eventarc.eventReceiver"
    }

  # module.export_pipeline.google_pubsub_topic.export_predictions_topic will be created
  + resource "google_pubsub_topic" "export_predictions_topic" {
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "86600s"
      + name                       = "climateiq-spatialize-and-export-predictions"
      + project                    = "climateiq-test"
      + terraform_labels           = (known after apply)
    }

  # module.export_pipeline.google_service_account.trigger_export will be created
  + resource "google_service_account" "trigger_export" {
      + account_id   = "gcf-trigger-export-sa"
      + disabled     = false
      + display_name = "Used By Trigger Export Cloud Function"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "climateiq-test"
      + unique_id    = (known after apply)
    }

  # module.export_pipeline.google_storage_bucket.chunk_predictions will be created
  + resource "google_storage_bucket" "chunk_predictions" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "test-climateiq-chunk-predictions"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.export_pipeline.google_storage_bucket.predictions will be created
  + resource "google_storage_bucket" "predictions" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "test-climateiq-predictions"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.export_pipeline.google_storage_bucket.source will be created
  + resource "google_storage_bucket" "source" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US-CENTRAL1"
      + name                        = "test-climateiq-frontend-cloud-functions"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.export_pipeline.google_storage_bucket_iam_member.trigger_export_chunk_predictions_writer will be created
  + resource "google_storage_bucket_iam_member" "trigger_export_chunk_predictions_writer" {
      + bucket = "test-climateiq-chunk-predictions"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectUser"
    }

  # module.export_pipeline.google_storage_bucket_iam_member.trigger_export_predictions_reader will be created
  + resource "google_storage_bucket_iam_member" "trigger_export_predictions_reader" {
      + bucket = "test-climateiq-predictions"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectViewer"
    }

  # module.export_pipeline.google_storage_bucket_object.source will be created
  + resource "google_storage_bucket_object" "source" {
      + bucket         = "test-climateiq-frontend-cloud-functions"
      + content        = (sensitive value)
      + content_type   = (known after apply)
      + crc32c         = (known after apply)
      + detect_md5hash = "different hash"
      + id             = (known after apply)
      + kms_key_name   = (known after apply)
      + md5hash        = (known after apply)
      + media_link     = (known after apply)
      + name           = "cloud_function_source.zip"
      + output_name    = (known after apply)
      + self_link      = (known after apply)
      + source         = "../modules/export_pipeline/files/cloud_function_source.zip"
      + storage_class  = (known after apply)
    }

Plan: 21 to add, 0 to change, 7 to destroy.

`